app/controllers/blog_posts_controller.rb

INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello Word 99"], ["body", "99"], ["created_at", "2023-11-02 13:49:09.600691"], ["updated_at", "2023-11-02 13:49:09.600691"]]
---
    def create
        @blog_post = BlogPost.new(blog_post_params)
        if @blog_post.save

UPDATE "blog_posts" SET "title" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["title", "Hello 123"], ["updated_at", "2023-11-10 13:07:31.003502"], ["id", 6]]
---
    def update
        if @blog_post.update(blog_post_params)